import '@styles/style';
import Controller from './app/controller';

const app = new Controller();
app.start();

console.log(
    `Самооценка: 215/220 \n- Стартовая страница и навигация +20\n- Настройки +25: \nв настройках есть возможность включать/выключать звук, есть регулятор громкости звука. Если звук включён, есть звуковая индикация правильных и неправильных ответов, звуковое сопровождение окончания раунда: реализована графическая часть с сохранением значения в localStorage +5\nв настройках есть возможность включать/выключать игру на время. Если выбрана игра на время, на странице с вопросами викторины отображается таймер, отсчитывающий время, которое отведено для ответа на вопрос +5 - аналогично\nв настройках можно указать время для ответа на вопрос в интервале от 5 до 30 секунд с шагом в 5 секунд. Если время истекает, а ответа нет, это засчитывается как неправильный ответ на вопрос - аналогично +5\nпри перезагрузке страницы приложения настройки сохраняются +10\n- Страница категорий +30\n- Страница с вопросами +50\n- Страница с результатами +50\n- Одновременная загрузка и плавная смена изображений +10\n- Анимация: плавный переход между страницами, выезд модального окна с результатом ответа +10\n- Дополнительный функционал +20: прелоадер на стартовой странице +5, модальное окно для выбора результатов скора с выводом соответствующей страницы +10, карточки после результатов раунда помимо индикатора правильных ответов помечаются индикатором filter: grayscale +5`
);
