import '@styles/style';
import Controller from './app/controller/controller';

const app = new Controller();
app.start();

console.log(
  'Самооценка: 210 / 200\n- Страница с игрушками содержит карточки всех игрушек а также фильтры, строку поиска, поле для сортировки. Выполняются требования к вёрстке +10\n- Карточка игрушки содержит её изображение, название, текстом или условным значком обозначено количество экземпляров, год покупки, форма, цвет, размер, является ли игрушка любимой +10\n- Добавление игрушек в избранное +20\n- Сортировка +20\n- Фильтры в указанном диапазоне от и до +30\n- Фильтры по значению +30\n- Можно отфильтровать игрушки по нескольким фильтрам разного типа +20\n- Сброс фильтров +20\n- Сохранение настроек в local storage +10\n- Поиск +30\n- Дополнительный функционал на выбор +10 (плавный переход между страницами, анимация избранных игрушек по клику на соотв. карту, плавное повторное появление контейнера с карточками при выборе различных фильтров)'
);
